load/results/after/fhir_sweep_vus5.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load/k6/fhir_sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 45s max duration (incl. graceful stop):
              * fhir_steady: 5 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 3975 complete and 0 interrupted iterations
fhir_steady   [   7% ] 5 VUs  01.0s/15s

running (02.0s), 5/5 VUs, 8007 complete and 0 interrupted iterations
fhir_steady   [  13% ] 5 VUs  02.0s/15s

running (03.0s), 5/5 VUs, 11966 complete and 0 interrupted iterations
fhir_steady   [  20% ] 5 VUs  03.0s/15s

running (04.0s), 5/5 VUs, 16034 complete and 0 interrupted iterations
fhir_steady   [  27% ] 5 VUs  04.0s/15s

running (05.0s), 5/5 VUs, 20252 complete and 0 interrupted iterations
fhir_steady   [  33% ] 5 VUs  05.0s/15s

running (06.0s), 5/5 VUs, 24384 complete and 0 interrupted iterations
fhir_steady   [  40% ] 5 VUs  06.0s/15s

running (07.0s), 5/5 VUs, 28102 complete and 0 interrupted iterations
fhir_steady   [  47% ] 5 VUs  07.0s/15s

running (08.0s), 5/5 VUs, 32106 complete and 0 interrupted iterations
fhir_steady   [  53% ] 5 VUs  08.0s/15s

running (09.0s), 5/5 VUs, 35535 complete and 0 interrupted iterations
fhir_steady   [  60% ] 5 VUs  09.0s/15s

running (10.0s), 5/5 VUs, 39514 complete and 0 interrupted iterations
fhir_steady   [  67% ] 5 VUs  10.0s/15s

running (11.0s), 5/5 VUs, 43622 complete and 0 interrupted iterations
fhir_steady   [  73% ] 5 VUs  11.0s/15s

running (12.0s), 5/5 VUs, 47742 complete and 0 interrupted iterations
fhir_steady   [  80% ] 5 VUs  12.0s/15s

running (13.0s), 5/5 VUs, 51811 complete and 0 interrupted iterations
fhir_steady   [  87% ] 5 VUs  13.0s/15s

running (14.0s), 5/5 VUs, 55833 complete and 0 interrupted iterations
fhir_steady   [  93% ] 5 VUs  14.0s/15s

running (15.0s), 5/5 VUs, 59998 complete and 0 interrupted iterations
fhir_steady   [ 100% ] 5 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 120046  8002.577976/s
    checks_succeeded...: 100.00% 120046 out of 120046
    checks_failed......: 0.00%   0 out of 120046

    ✓ status is 200
    ✓ has resourceType

    HTTP
    http_req_duration..............: avg=1.21ms min=282µs    med=1.11ms p(95)=1.62ms p(99)=2.15ms max=13.24ms
      { expected_response:true }...: avg=1.21ms min=282µs    med=1.11ms p(95)=1.62ms p(99)=2.15ms max=13.24ms
    http_req_failed................: 0.00%  0 out of 60023
    http_reqs......................: 60023  4001.288988/s

    EXECUTION
    iteration_duration.............: avg=1.24ms min=309.41µs med=1.14ms p(95)=1.65ms p(99)=2.23ms max=13.29ms
    iterations.....................: 60023  4001.288988/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 17 MB  1.2 MB/s
    data_sent......................: 5.6 MB 376 kB/s



running (15.0s), 0/5 VUs, 60023 complete and 0 interrupted iterations
fhir_steady ✓ [ 100% ] 5 VUs  15s